{
  "auto_mapping": null,
  "base_model_name_or_path": "bert-base-uncased",
  "inference_mode": true,
  "num_attention_heads": 12,
  "num_layers": 12,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 64,
  "peft_type": "PROMPT_TUNING",
  "prompt_tuning_init": "TEXT",
  "prompt_tuning_init_text": "Below is an instruction that describes a task, paired with an input that provides further context. Write a response that appropriately completes the request.\n\n### Instruction:\nAnalyze the provided movie critique's sentiments about the film and label the emotions as either \"positive\" or \"negative\" to indicate the overall sentiment.",
  "revision": null,
  "task_type": "SEQ_CLS",
  "token_dim": 768,
  "tokenizer_name_or_path": "bert-base-uncased"
}