{
  "auto_mapping": null,
  "base_model_name_or_path": "gpt2",
  "inference_mode": true,
  "num_attention_heads": 12,
  "num_layers": 12,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 15,
  "peft_type": "PROMPT_TUNING",
  "prompt_tuning_init": "TEXT",
  "prompt_tuning_init_text": "Would you say this sentence is subjective or objective?\nsubjective, objective",
  "revision": null,
  "task_type": "CAUSAL_LM",
  "token_dim": 768,
  "tokenizer_name_or_path": "gpt2"
}